In [51]:
import pandas as pd 
df = pd.read_csv("type1_data1.csv")


# 1. "views" 컬럼의 결측 데이터를 0으로 대체하시오. 
# 2. "views" 컬럼에서 상위 10번째 값을 구하시오
# 3. "views" 컬럼에서 상위 10개의 값을 상위 10번째 값을 대체하시오. 
# 4. "views" 컬럼의 전체 합을 정수로 구하시오.

In [52]:
df.head(1)
df.isnull().sum()

id             0
age            0
city           0
f1            31
f2             0
f3            29
f4             0
f5             0
subscribed     0
views          4
dtype: int64

In [53]:
# 1. 
df = df.fillna(0)
df.isnull().sum()

id            0
age           0
city          0
f1            0
f2            0
f3            0
f4            0
f5            0
subscribed    0
views         0
dtype: int64

In [60]:
# 2. "views" 컬럼에서 상위 10번째 값을 구하시오

df = df.sort_values("views", ascending=False) 
a = df[:10]
result2 = a.iloc[:10, -1].min()
result2

np.float64(9877.0)

In [61]:
# 3. "views" 컬럼에서 상위 10개의 값을 상위 10번째 값을 대체하시오. 


df.iloc[0:10, -1] = result2
df[:11]

        id   age city    f1  f2      f3    f4         f5  subscribed   views
5     id06  22.0   서울  57.0   0     vip  INTP  20.129444  2024-09-12  9877.0
56    id56  59.0   대구   0.0   1     vip  ESTJ  73.586397  2024-04-05  9877.0
83    id83  73.0   경기  50.0   1     vip  ENTP  80.138280  2024-09-26  9877.0
32    id32  25.0   부산  64.0   0     vip  ISFJ  13.049921  2024-05-24  9877.0
10   id100  47.0   경기  53.0   0     vip  ESFP  33.308999  2024-02-21  9877.0
100  id100  47.0   경기  53.0   0     vip  ESFP  33.308999  2024-02-21  9877.0
104  id103  21.0   부산  53.0   0     vip  ISFP   0.000000  2025-02-17  9877.0
114  id113  22.0   경기  34.0   2  silver  ENTP   0.000000  2025-02-17  9877.0
9     id10  95.0   서울  74.0   1    gold  ISFP  98.429899  2024-04-03  9877.0
113  id112  22.0   서울  45.0   2     vip  ENTP   0.000000  2025-02-17  9877.0
115  id114  22.0   대구  23.0   0    gold  INTP   0.000000  2025-02-17  9747.0

In [62]:
# 4. "views" 컬럼의 전체 합을 정수로 구하시오.

df["views"].sum()

np.float64(652812.0)

In [ ]:
# 1. "views" 컬럼의 결측 데이터를 0으로 대체
df['views'] = df['views'].fillna(0)

# 2. "views" 컬럼에서 상위 10번째 값을 구하기
# 내림차순으로 정렬 후 10번째 값 (인덱스 9)
views_sorted = df['views'].sort_values(ascending=False)

# 데이터가 10개 이상인지 확인
if len(views_sorted) < 10:
    raise ValueError("데이터가 10개 미만입니다. 상위 10번째 값을 구할 수 없습니다.")

상위_10번째_값 = views_sorted.iloc[9]  # 인덱스는 0부터 시작하므로 9가 10번째
print(f"상위 10번째 값: {상위_10번째_값}")

# 3. "views" 컬럼에서 상위 10개의 값을 상위 10번째 값으로 대체
# 상위 10개 행의 인덱스를 찾아서 값을 대체
상위_10개_인덱스 = views_sorted.head(10).index
df.loc[상위_10개_인덱스, 'views'] = 상위_10번째_값

# 4. "views" 컬럼의 전체 합을 정수로 구하기
views_전체_합 = int(df['views'].sum())
print(f"views 컬럼 전체 합: {views_전체_합}")

상위 10번째 값: 9747.0
views 컬럼 전체 합: 474564